SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_acmp.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 ACMP register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_ACMP_H
#define EFR32SG23_ACMP_H

#define ACMP_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG23_ACMP ACMP
 * @{
 * @brief EFR32SG23 ACMP Register Declaration.
 *****************************************************************************/

/** ACMP Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP version ID                                      */
  __IOM uint32_t             EN;                     /**< ACMP enable                                        */
  __IOM uint32_t             SWRST;                  /**< Software reset                                     */
  __IOM uint32_t             CFG;                    /**< Configuration register                             */
  __IOM uint32_t             CTRL;                   /**< Control Register                                   */
  __IOM uint32_t             INPUTCTRL;              /**< Input Control Register                             */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
  __IM  uint32_t             SYNCBUSY;               /**< Syncbusy                                           */
        uint32_t             RESERVED0[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP version ID                                      */
  __IOM uint32_t             EN_SET;                 /**< ACMP enable                                        */
  __IOM uint32_t             SWRST_SET;              /**< Software reset                                     */
  __IOM uint32_t             CFG_SET;                /**< Configuration register                             */
  __IOM uint32_t             CTRL_SET;               /**< Control Register                                   */
  __IOM uint32_t             INPUTCTRL_SET;          /**< Input Control Register                             */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
  __IM  uint32_t             SYNCBUSY_SET;           /**< Syncbusy                                           */
        uint32_t             RESERVED1[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP version ID                                      */
  __IOM uint32_t             EN_CLR;                 /**< ACMP enable                                        */
  __IOM uint32_t             SWRST_CLR;              /**< Software reset                                     */
  __IOM uint32_t             CFG_CLR;                /**< Configuration register                             */
  __IOM uint32_t             CTRL_CLR;               /**< Control Register                                   */
  __IOM uint32_t             INPUTCTRL_CLR;          /**< Input Control Register                             */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
  __IM  uint32_t             SYNCBUSY_CLR;           /**< Syncbusy                                           */
        uint32_t             RESERVED2[1014U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP version ID                                      */
  __IOM uint32_t             EN_TGL;                 /**< ACMP enable                                        */
  __IOM uint32_t             SWRST_TGL;              /**< Software reset                                     */
  __IOM uint32_t             CFG_TGL;                /**< Configuration register                             */
  __IOM uint32_t             CTRL_TGL;               /**< Control Register                                   */
  __IOM uint32_t             INPUTCTRL_TGL;          /**< Input Control Register                             */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
  __IM  uint32_t             SYNCBUSY_TGL;           /**< Syncbusy                                           */
} ACMP_TypeDef;
/** @} End of group EFR32SG23_ACMP */

/**************************************************************************//**
 * @addtogroup EFR32SG23_ACMP
 * @{
 * @defgroup EFR32SG23_ACMP_BitFields ACMP Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for ACMP IPVERSION */
#define _ACMP_IPVERSION_RESETVALUE              0x00000001UL                            /**< Default value for ACMP_IPVERSION            */
#define _ACMP_IPVERSION_MASK                    0xFFFFFFFFUL                            /**< Mask for ACMP_IPVERSION                     */
#define _ACMP_IPVERSION_IPVERSION_SHIFT         0                                       /**< Shift value for ACMP_IPVERSION              */
#define _ACMP_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                            /**< Bit mask for ACMP_IPVERSION                 */
#define _ACMP_IPVERSION_IPVERSION_DEFAULT       0x00000001UL                            /**< Mode DEFAULT for ACMP_IPVERSION             */
#define ACMP_IPVERSION_IPVERSION_DEFAULT        (_ACMP_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for ACMP_IPVERSION     */

/* Bit fields for ACMP EN */
#define _ACMP_EN_RESETVALUE                     0x00000000UL                            /**< Default value for ACMP_EN                   */
#define _ACMP_EN_MASK                           0x00000003UL                            /**< Mask for ACMP_EN                            */
#define ACMP_EN_EN                              (0x1UL << 0)                            /**< Module enable                               */
#define _ACMP_EN_EN_SHIFT                       0                                       /**< Shift value for ACMP_EN                     */
#define _ACMP_EN_EN_MASK                        0x1UL                                   /**< Bit mask for ACMP_EN                        */
#define _ACMP_EN_EN_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for ACMP_EN                    */
#define ACMP_EN_EN_DEFAULT                      (_ACMP_EN_EN_DEFAULT << 0)              /**< Shifted mode DEFAULT for ACMP_EN            */
#define ACMP_EN_DISABLING                       (0x1UL << 1)                            /**< Disablement busy status                     */
#define _ACMP_EN_DISABLING_SHIFT                1                                       /**< Shift value for ACMP_DISABLING              */
#define _ACMP_EN_DISABLING_MASK                 0x2UL                                   /**< Bit mask for ACMP_DISABLING                 */
#define _ACMP_EN_DISABLING_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for ACMP_EN                    */
#define ACMP_EN_DISABLING_DEFAULT               (_ACMP_EN_DISABLING_DEFAULT << 1)       /**< Shifted mode DEFAULT for ACMP_EN            */

