SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_acmp.h
/* Bit fields for ACMP SWRST */
#define _ACMP_SWRST_RESETVALUE                  0x00000000UL                            /**< Default value for ACMP_SWRST                */
#define _ACMP_SWRST_MASK                        0x00000003UL                            /**< Mask for ACMP_SWRST                         */
#define ACMP_SWRST_SWRST                        (0x1UL << 0)                            /**< Software reset                              */
#define _ACMP_SWRST_SWRST_SHIFT                 0                                       /**< Shift value for ACMP_SWRST                  */
#define _ACMP_SWRST_SWRST_MASK                  0x1UL                                   /**< Bit mask for ACMP_SWRST                     */
#define _ACMP_SWRST_SWRST_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for ACMP_SWRST                 */
#define ACMP_SWRST_SWRST_DEFAULT                (_ACMP_SWRST_SWRST_DEFAULT << 0)        /**< Shifted mode DEFAULT for ACMP_SWRST         */
#define ACMP_SWRST_RESETTING                    (0x1UL << 1)                            /**< Software reset busy status                  */
#define _ACMP_SWRST_RESETTING_SHIFT             1                                       /**< Shift value for ACMP_RESETTING              */
#define _ACMP_SWRST_RESETTING_MASK              0x2UL                                   /**< Bit mask for ACMP_RESETTING                 */
#define _ACMP_SWRST_RESETTING_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for ACMP_SWRST                 */
#define ACMP_SWRST_RESETTING_DEFAULT            (_ACMP_SWRST_RESETTING_DEFAULT << 1)    /**< Shifted mode DEFAULT for ACMP_SWRST         */

/* Bit fields for ACMP CFG */
#define _ACMP_CFG_RESETVALUE                    0x00000004UL                            /**< Default value for ACMP_CFG                  */
#define _ACMP_CFG_MASK                          0x00030F07UL                            /**< Mask for ACMP_CFG                           */
#define _ACMP_CFG_BIAS_SHIFT                    0                                       /**< Shift value for ACMP_BIAS                   */
#define _ACMP_CFG_BIAS_MASK                     0x7UL                                   /**< Bit mask for ACMP_BIAS                      */
#define _ACMP_CFG_BIAS_DEFAULT                  0x00000004UL                            /**< Mode DEFAULT for ACMP_CFG                   */
#define ACMP_CFG_BIAS_DEFAULT                   (_ACMP_CFG_BIAS_DEFAULT << 0)           /**< Shifted mode DEFAULT for ACMP_CFG           */
#define _ACMP_CFG_HYST_SHIFT                    8                                       /**< Shift value for ACMP_HYST                   */
#define _ACMP_CFG_HYST_MASK                     0xF00UL                                 /**< Bit mask for ACMP_HYST                      */
#define _ACMP_CFG_HYST_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for ACMP_CFG                   */
#define _ACMP_CFG_HYST_DISABLED                 0x00000000UL                            /**< Mode DISABLED for ACMP_CFG                  */
#define _ACMP_CFG_HYST_SYM10MV                  0x00000001UL                            /**< Mode SYM10MV for ACMP_CFG                   */
#define _ACMP_CFG_HYST_SYM20MV                  0x00000002UL                            /**< Mode SYM20MV for ACMP_CFG                   */
#define _ACMP_CFG_HYST_SYM30MV                  0x00000003UL                            /**< Mode SYM30MV for ACMP_CFG                   */
#define _ACMP_CFG_HYST_POS10MV                  0x00000004UL                            /**< Mode POS10MV for ACMP_CFG                   */
#define _ACMP_CFG_HYST_POS20MV                  0x00000005UL                            /**< Mode POS20MV for ACMP_CFG                   */
#define _ACMP_CFG_HYST_POS30MV                  0x00000006UL                            /**< Mode POS30MV for ACMP_CFG                   */
#define _ACMP_CFG_HYST_NEG10MV                  0x00000008UL                            /**< Mode NEG10MV for ACMP_CFG                   */
#define _ACMP_CFG_HYST_NEG20MV                  0x00000009UL                            /**< Mode NEG20MV for ACMP_CFG                   */
#define _ACMP_CFG_HYST_NEG30MV                  0x0000000AUL                            /**< Mode NEG30MV for ACMP_CFG                   */
#define ACMP_CFG_HYST_DEFAULT                   (_ACMP_CFG_HYST_DEFAULT << 8)           /**< Shifted mode DEFAULT for ACMP_CFG           */
#define ACMP_CFG_HYST_DISABLED                  (_ACMP_CFG_HYST_DISABLED << 8)          /**< Shifted mode DISABLED for ACMP_CFG          */
#define ACMP_CFG_HYST_SYM10MV                   (_ACMP_CFG_HYST_SYM10MV << 8)           /**< Shifted mode SYM10MV for ACMP_CFG           */
#define ACMP_CFG_HYST_SYM20MV                   (_ACMP_CFG_HYST_SYM20MV << 8)           /**< Shifted mode SYM20MV for ACMP_CFG           */
#define ACMP_CFG_HYST_SYM30MV                   (_ACMP_CFG_HYST_SYM30MV << 8)           /**< Shifted mode SYM30MV for ACMP_CFG           */
#define ACMP_CFG_HYST_POS10MV                   (_ACMP_CFG_HYST_POS10MV << 8)           /**< Shifted mode POS10MV for ACMP_CFG           */
#define ACMP_CFG_HYST_POS20MV                   (_ACMP_CFG_HYST_POS20MV << 8)           /**< Shifted mode POS20MV for ACMP_CFG           */
#define ACMP_CFG_HYST_POS30MV                   (_ACMP_CFG_HYST_POS30MV << 8)           /**< Shifted mode POS30MV for ACMP_CFG           */
#define ACMP_CFG_HYST_NEG10MV                   (_ACMP_CFG_HYST_NEG10MV << 8)           /**< Shifted mode NEG10MV for ACMP_CFG           */
#define ACMP_CFG_HYST_NEG20MV                   (_ACMP_CFG_HYST_NEG20MV << 8)           /**< Shifted mode NEG20MV for ACMP_CFG           */
#define ACMP_CFG_HYST_NEG30MV                   (_ACMP_CFG_HYST_NEG30MV << 8)           /**< Shifted mode NEG30MV for ACMP_CFG           */
#define ACMP_CFG_INPUTRANGE                     (0x1UL << 16)                           /**< Input Range                                 */
#define _ACMP_CFG_INPUTRANGE_SHIFT              16                                      /**< Shift value for ACMP_INPUTRANGE             */
#define _ACMP_CFG_INPUTRANGE_MASK               0x10000UL                               /**< Bit mask for ACMP_INPUTRANGE                */
#define _ACMP_CFG_INPUTRANGE_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for ACMP_CFG                   */
#define _ACMP_CFG_INPUTRANGE_FULL               0x00000000UL                            /**< Mode FULL for ACMP_CFG                      */
#define _ACMP_CFG_INPUTRANGE_REDUCED            0x00000001UL                            /**< Mode REDUCED for ACMP_CFG                   */
#define ACMP_CFG_INPUTRANGE_DEFAULT             (_ACMP_CFG_INPUTRANGE_DEFAULT << 16)    /**< Shifted mode DEFAULT for ACMP_CFG           */
#define ACMP_CFG_INPUTRANGE_FULL                (_ACMP_CFG_INPUTRANGE_FULL << 16)       /**< Shifted mode FULL for ACMP_CFG              */
#define ACMP_CFG_INPUTRANGE_REDUCED             (_ACMP_CFG_INPUTRANGE_REDUCED << 16)    /**< Shifted mode REDUCED for ACMP_CFG           */
#define ACMP_CFG_ACCURACY                       (0x1UL << 17)                           /**< ACMP accuracy mode                          */
#define _ACMP_CFG_ACCURACY_SHIFT                17                                      /**< Shift value for ACMP_ACCURACY               */
#define _ACMP_CFG_ACCURACY_MASK                 0x20000UL                               /**< Bit mask for ACMP_ACCURACY                  */
#define _ACMP_CFG_ACCURACY_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for ACMP_CFG                   */
#define _ACMP_CFG_ACCURACY_LOW                  0x00000000UL                            /**< Mode LOW for ACMP_CFG                       */
#define _ACMP_CFG_ACCURACY_HIGH                 0x00000001UL                            /**< Mode HIGH for ACMP_CFG                      */
#define ACMP_CFG_ACCURACY_DEFAULT               (_ACMP_CFG_ACCURACY_DEFAULT << 17)      /**< Shifted mode DEFAULT for ACMP_CFG           */
#define ACMP_CFG_ACCURACY_LOW                   (_ACMP_CFG_ACCURACY_LOW << 17)          /**< Shifted mode LOW for ACMP_CFG               */
#define ACMP_CFG_ACCURACY_HIGH                  (_ACMP_CFG_ACCURACY_HIGH << 17)         /**< Shifted mode HIGH for ACMP_CFG              */

