SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_acmp.h
#define ACMP_INPUTCTRL_NEGSEL_PD9               (_ACMP_INPUTCTRL_NEGSEL_PD9 << 8)       /**< Shifted mode PD9 for ACMP_INPUTCTRL         */
#define ACMP_INPUTCTRL_NEGSEL_PD10              (_ACMP_INPUTCTRL_NEGSEL_PD10 << 8)      /**< Shifted mode PD10 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_NEGSEL_PD11              (_ACMP_INPUTCTRL_NEGSEL_PD11 << 8)      /**< Shifted mode PD11 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_NEGSEL_PD12              (_ACMP_INPUTCTRL_NEGSEL_PD12 << 8)      /**< Shifted mode PD12 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_NEGSEL_PD13              (_ACMP_INPUTCTRL_NEGSEL_PD13 << 8)      /**< Shifted mode PD13 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_NEGSEL_PD14              (_ACMP_INPUTCTRL_NEGSEL_PD14 << 8)      /**< Shifted mode PD14 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_NEGSEL_PD15              (_ACMP_INPUTCTRL_NEGSEL_PD15 << 8)      /**< Shifted mode PD15 for ACMP_INPUTCTRL        */
#define _ACMP_INPUTCTRL_VREFDIV_SHIFT           16                                      /**< Shift value for ACMP_VREFDIV                */
#define _ACMP_INPUTCTRL_VREFDIV_MASK            0x3F0000UL                              /**< Bit mask for ACMP_VREFDIV                   */
#define _ACMP_INPUTCTRL_VREFDIV_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for ACMP_INPUTCTRL             */
#define ACMP_INPUTCTRL_VREFDIV_DEFAULT          (_ACMP_INPUTCTRL_VREFDIV_DEFAULT << 16) /**< Shifted mode DEFAULT for ACMP_INPUTCTRL     */
#define _ACMP_INPUTCTRL_CSRESSEL_SHIFT          28                                      /**< Shift value for ACMP_CSRESSEL               */
#define _ACMP_INPUTCTRL_CSRESSEL_MASK           0x70000000UL                            /**< Bit mask for ACMP_CSRESSEL                  */
#define _ACMP_INPUTCTRL_CSRESSEL_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for ACMP_INPUTCTRL             */
#define _ACMP_INPUTCTRL_CSRESSEL_RES0           0x00000000UL                            /**< Mode RES0 for ACMP_INPUTCTRL                */
#define _ACMP_INPUTCTRL_CSRESSEL_RES1           0x00000001UL                            /**< Mode RES1 for ACMP_INPUTCTRL                */
#define _ACMP_INPUTCTRL_CSRESSEL_RES2           0x00000002UL                            /**< Mode RES2 for ACMP_INPUTCTRL                */
#define _ACMP_INPUTCTRL_CSRESSEL_RES3           0x00000003UL                            /**< Mode RES3 for ACMP_INPUTCTRL                */
#define _ACMP_INPUTCTRL_CSRESSEL_RES4           0x00000004UL                            /**< Mode RES4 for ACMP_INPUTCTRL                */
#define _ACMP_INPUTCTRL_CSRESSEL_RES5           0x00000005UL                            /**< Mode RES5 for ACMP_INPUTCTRL                */
#define _ACMP_INPUTCTRL_CSRESSEL_RES6           0x00000006UL                            /**< Mode RES6 for ACMP_INPUTCTRL                */
#define ACMP_INPUTCTRL_CSRESSEL_DEFAULT         (_ACMP_INPUTCTRL_CSRESSEL_DEFAULT << 28) /**< Shifted mode DEFAULT for ACMP_INPUTCTRL     */
#define ACMP_INPUTCTRL_CSRESSEL_RES0            (_ACMP_INPUTCTRL_CSRESSEL_RES0 << 28)   /**< Shifted mode RES0 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_CSRESSEL_RES1            (_ACMP_INPUTCTRL_CSRESSEL_RES1 << 28)   /**< Shifted mode RES1 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_CSRESSEL_RES2            (_ACMP_INPUTCTRL_CSRESSEL_RES2 << 28)   /**< Shifted mode RES2 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_CSRESSEL_RES3            (_ACMP_INPUTCTRL_CSRESSEL_RES3 << 28)   /**< Shifted mode RES3 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_CSRESSEL_RES4            (_ACMP_INPUTCTRL_CSRESSEL_RES4 << 28)   /**< Shifted mode RES4 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_CSRESSEL_RES5            (_ACMP_INPUTCTRL_CSRESSEL_RES5 << 28)   /**< Shifted mode RES5 for ACMP_INPUTCTRL        */
#define ACMP_INPUTCTRL_CSRESSEL_RES6            (_ACMP_INPUTCTRL_CSRESSEL_RES6 << 28)   /**< Shifted mode RES6 for ACMP_INPUTCTRL        */

/* Bit fields for ACMP STATUS */
#define _ACMP_STATUS_RESETVALUE                 0x00000000UL                            /**< Default value for ACMP_STATUS               */
#define _ACMP_STATUS_MASK                       0x0000001DUL                            /**< Mask for ACMP_STATUS                        */
#define ACMP_STATUS_ACMPOUT                     (0x1UL << 0)                            /**< Analog Comparator Output                    */
#define _ACMP_STATUS_ACMPOUT_SHIFT              0                                       /**< Shift value for ACMP_ACMPOUT                */
#define _ACMP_STATUS_ACMPOUT_MASK               0x1UL                                   /**< Bit mask for ACMP_ACMPOUT                   */
#define _ACMP_STATUS_ACMPOUT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for ACMP_STATUS                */
#define ACMP_STATUS_ACMPOUT_DEFAULT             (_ACMP_STATUS_ACMPOUT_DEFAULT << 0)     /**< Shifted mode DEFAULT for ACMP_STATUS        */
#define ACMP_STATUS_ACMPRDY                     (0x1UL << 2)                            /**< Analog Comparator Ready                     */
#define _ACMP_STATUS_ACMPRDY_SHIFT              2                                       /**< Shift value for ACMP_ACMPRDY                */
#define _ACMP_STATUS_ACMPRDY_MASK               0x4UL                                   /**< Bit mask for ACMP_ACMPRDY                   */
#define _ACMP_STATUS_ACMPRDY_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for ACMP_STATUS                */
#define ACMP_STATUS_ACMPRDY_DEFAULT             (_ACMP_STATUS_ACMPRDY_DEFAULT << 2)     /**< Shifted mode DEFAULT for ACMP_STATUS        */
#define ACMP_STATUS_INPUTCONFLICT               (0x1UL << 3)                            /**< INPUT conflict                              */
#define _ACMP_STATUS_INPUTCONFLICT_SHIFT        3                                       /**< Shift value for ACMP_INPUTCONFLICT          */
#define _ACMP_STATUS_INPUTCONFLICT_MASK         0x8UL                                   /**< Bit mask for ACMP_INPUTCONFLICT             */
#define _ACMP_STATUS_INPUTCONFLICT_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for ACMP_STATUS                */
#define ACMP_STATUS_INPUTCONFLICT_DEFAULT       (_ACMP_STATUS_INPUTCONFLICT_DEFAULT << 3) /**< Shifted mode DEFAULT for ACMP_STATUS        */
#define ACMP_STATUS_PORTALLOCERR                (0x1UL << 4)                            /**< Port allocation error                       */
#define _ACMP_STATUS_PORTALLOCERR_SHIFT         4                                       /**< Shift value for ACMP_PORTALLOCERR           */
#define _ACMP_STATUS_PORTALLOCERR_MASK          0x10UL                                  /**< Bit mask for ACMP_PORTALLOCERR              */
#define _ACMP_STATUS_PORTALLOCERR_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for ACMP_STATUS                */
#define ACMP_STATUS_PORTALLOCERR_DEFAULT        (_ACMP_STATUS_PORTALLOCERR_DEFAULT << 4) /**< Shifted mode DEFAULT for ACMP_STATUS        */

